[
	{
		"name": {
			"en": "Introduction to Web Development",
			"es": "Introducción al Desarrollo Web",
			"fr": "Introduction au Développement Web",
			"de": "Einführung in die Webentwicklung",
			"it": "Introduzione allo Sviluppo Web",
			"pt": "Introdução ao Desenvolvimento Web",
			"ru": "Введение в веб-разработку",
			"zh": "Web开发入门",
			"ja": "Web開発入門",
			"ko": "웹 개발 소개"
		},
		"order": 1,
		"image": "https://example.com/images/web-dev-course.jpg",
		"slug": "introduction-to-web-development",
		"description": {
			"en": "Learn the fundamentals of web development including HTML, CSS, and JavaScript. Perfect for beginners who want to start their journey in web development.",
			"es": "Aprende los fundamentos del desarrollo web incluyendo HTML, CSS y JavaScript. Perfecto para principiantes que quieren comenzar su viaje en el desarrollo web.",
			"fr": "Apprenez les fondamentaux du développement web incluant HTML, CSS et JavaScript. Parfait pour les débutants qui veulent commencer leur parcours en développement web.",
			"de": "Lernen Sie die Grundlagen der Webentwicklung einschließlich HTML, CSS und JavaScript. Perfekt für Anfänger, die ihre Reise in der Webentwicklung beginnen möchten.",
			"it": "Impara i fondamenti dello sviluppo web inclusi HTML, CSS e JavaScript. Perfetto per i principianti che vogliono iniziare il loro viaggio nello sviluppo web.",
			"pt": "Aprenda os fundamentos do desenvolvimento web incluindo HTML, CSS e JavaScript. Perfeito para iniciantes que querem começar sua jornada no desenvolvimento web.",
			"ru": "Изучите основы веб-разработки, включая HTML, CSS и JavaScript. Идеально подходит для начинающих, которые хотят начать свой путь в веб-разработке.",
			"zh": "学习Web开发的基础知识，包括HTML、CSS和JavaScript。非常适合想要开始Web开发之旅的初学者。",
			"ja": "HTML、CSS、JavaScriptを含むWeb開発の基礎を学びます。Web開発の旅を始めたい初心者に最適です。",
			"ko": "HTML, CSS, JavaScript를 포함한 웹 개발의 기초를 배웁니다. 웹 개발 여정을 시작하고 싶은 초보자에게 완벽합니다."
		},
		"presentedBy": "John Smith",
		"instructorImage": "https://example.com/images/john-smith.jpg",
		"isModular": true,
		"isDraft": false,
		"introVideo": {
			"en": "https://example.com/videos/web-dev-intro-en.mp4",
			"es": "https://example.com/videos/web-dev-intro-es.mp4",
			"fr": "https://example.com/videos/web-dev-intro-fr.mp4",
			"de": "https://example.com/videos/web-dev-intro-de.mp4",
			"it": "https://example.com/videos/web-dev-intro-it.mp4",
			"pt": "https://example.com/videos/web-dev-intro-pt.mp4",
			"ru": "https://example.com/videos/web-dev-intro-ru.mp4",
			"zh": "https://example.com/videos/web-dev-intro-zh.mp4",
			"ja": "https://example.com/videos/web-dev-intro-ja.mp4",
			"ko": "https://example.com/videos/web-dev-intro-ko.mp4"
		},
		"introVideoTranscribe": {
			"en": "Welcome to Introduction to Web Development. In this course, you will learn...",
			"es": "Bienvenido a Introducción al Desarrollo Web. En este curso, aprenderás...",
			"fr": "Bienvenue dans Introduction au Développement Web. Dans ce cours, vous apprendrez...",
			"de": "Willkommen zur Einführung in die Webentwicklung. In diesem Kurs lernen Sie...",
			"it": "Benvenuto in Introduzione allo Sviluppo Web. In questo corso imparerai...",
			"pt": "Bem-vindo à Introdução ao Desenvolvimento Web. Neste curso, você aprenderá...",
			"ru": "Добро пожаловать во Введение в веб-разработку. В этом курсе вы узнаете...",
			"zh": "欢迎来到Web开发入门。在本课程中，您将学习...",
			"ja": "Web開発入門へようこそ。このコースでは、次のことを学びます...",
			"ko": "웹 개발 소개에 오신 것을 환영합니다. 이 과정에서 배우게 될 내용은..."
		},
		"modules": [],
		"sessions": [],
		"availableLanguages": [
			"en",
			"es",
			"fr",
			"de",
			"it",
			"pt",
			"ru",
			"zh",
			"ja",
			"ko"
		]
	},
	{
		"name": {
			"en": "Advanced JavaScript Mastery",
			"es": "Dominio Avanzado de JavaScript",
			"fr": "Maîtrise Avancée de JavaScript",
			"de": "Fortgeschrittene JavaScript-Beherrschung",
			"it": "Padronanza Avanzata di JavaScript",
			"pt": "Domínio Avançado de JavaScript",
			"ru": "Продвинутое мастерство JavaScript",
			"zh": "高级JavaScript精通",
			"ja": "高度なJavaScript習得",
			"ko": "고급 JavaScript 마스터리"
		},
		"order": 2,
		"image": "https://example.com/images/js-advanced-course.jpg",
		"slug": "advanced-javascript-mastery",
		"description": {
			"en": "Deep dive into advanced JavaScript concepts including closures, async/await, design patterns, and modern ES6+ features.",
			"es": "Profundiza en conceptos avanzados de JavaScript incluyendo cierres, async/await, patrones de diseño y características modernas de ES6+.",
			"fr": "Plongez dans les concepts avancés de JavaScript incluant les fermetures, async/await, les modèles de conception et les fonctionnalités modernes ES6+.",
			"de": "Tauchen Sie tief in fortgeschrittene JavaScript-Konzepte ein, einschließlich Closures, async/await, Entwurfsmuster und moderne ES6+-Funktionen.",
			"it": "Approfondisci i concetti avanzati di JavaScript inclusi chiusure, async/await, pattern di progettazione e funzionalità moderne ES6+.",
			"pt": "Mergulhe em conceitos avançados de JavaScript incluindo closures, async/await, padrões de design e recursos modernos do ES6+.",
			"ru": "Погрузитесь в продвинутые концепции JavaScript, включая замыкания, async/await, шаблоны проектирования и современные функции ES6+.",
			"zh": "深入学习高级JavaScript概念，包括闭包、async/await、设计模式和现代ES6+特性。",
			"ja": "クロージャ、async/await、デザインパターン、モダンなES6+機能を含む高度なJavaScriptの概念を深く掘り下げます。",
			"ko": "클로저, async/await, 디자인 패턴 및 최신 ES6+ 기능을 포함한 고급 JavaScript 개념을 깊이 있게 다룹니다."
		},
		"presentedBy": "Sarah Johnson",
		"instructorImage": "https://example.com/images/sarah-johnson.jpg",
		"isModular": false,
		"isDraft": false,
		"introVideo": {
			"en": "https://example.com/videos/js-advanced-intro-en.mp4",
			"es": "https://example.com/videos/js-advanced-intro-es.mp4",
			"fr": "https://example.com/videos/js-advanced-intro-fr.mp4",
			"de": "https://example.com/videos/js-advanced-intro-de.mp4",
			"it": "https://example.com/videos/js-advanced-intro-it.mp4",
			"pt": "https://example.com/videos/js-advanced-intro-pt.mp4",
			"ru": "https://example.com/videos/js-advanced-intro-ru.mp4",
			"zh": "https://example.com/videos/js-advanced-intro-zh.mp4",
			"ja": "https://example.com/videos/js-advanced-intro-ja.mp4",
			"ko": "https://example.com/videos/js-advanced-intro-ko.mp4"
		},
		"introVideoTranscribe": {
			"en": "Welcome to Advanced JavaScript Mastery. This course will take your JavaScript skills to the next level...",
			"es": "Bienvenido a Dominio Avanzado de JavaScript. Este curso llevará tus habilidades de JavaScript al siguiente nivel...",
			"fr": "Bienvenue dans Maîtrise Avancée de JavaScript. Ce cours portera vos compétences JavaScript au niveau supérieur...",
			"de": "Willkommen zur fortgeschrittenen JavaScript-Beherrschung. Dieser Kurs bringt Ihre JavaScript-Fähigkeiten auf die nächste Stufe...",
			"it": "Benvenuto in Padronanza Avanzata di JavaScript. Questo corso porterà le tue competenze JavaScript al livello successivo...",
			"pt": "Bem-vindo ao Domínio Avançado de JavaScript. Este curso levará suas habilidades de JavaScript para o próximo nível...",
			"ru": "Добро пожаловать в Продвинутое мастерство JavaScript. Этот курс выведет ваши навыки JavaScript на следующий уровень...",
			"zh": "欢迎来到高级JavaScript精通。本课程将把您的JavaScript技能提升到新的水平...",
			"ja": "高度なJavaScript習得へようこそ。このコースは、あなたのJavaScriptスキルを次のレベルに引き上げます...",
			"ko": "고급 JavaScript 마스터리에 오신 것을 환영합니다. 이 과정은 JavaScript 기술을 다음 단계로 끌어올립니다..."
		},
		"modules": [],
		"sessions": [],
		"availableLanguages": [
			"en",
			"es",
			"fr",
			"de",
			"it",
			"pt",
			"ru",
			"zh",
			"ja",
			"ko"
		]
	},
	{
		"name": {
			"en": "Full Stack Development with React and Node.js",
			"es": "Desarrollo Full Stack con React y Node.js",
			"fr": "Développement Full Stack avec React et Node.js",
			"de": "Full-Stack-Entwicklung mit React und Node.js",
			"it": "Sviluppo Full Stack con React e Node.js",
			"pt": "Desenvolvimento Full Stack com React e Node.js",
			"ru": "Full Stack разработка с React и Node.js",
			"zh": "使用React和Node.js进行全栈开发",
			"ja": "ReactとNode.jsを使ったフルスタック開発",
			"ko": "React 및 Node.js를 사용한 풀스택 개발"
		},
		"order": 3,
		"image": "https://example.com/images/fullstack-course.jpg",
		"slug": "full-stack-development-react-nodejs",
		"description": {
			"en": "Build complete web applications from frontend to backend using React for the client and Node.js for the server. Learn to deploy and scale your applications.",
			"es": "Construye aplicaciones web completas desde el frontend hasta el backend usando React para el cliente y Node.js para el servidor. Aprende a desplegar y escalar tus aplicaciones.",
			"fr": "Construisez des applications web complètes du frontend au backend en utilisant React pour le client et Node.js pour le serveur. Apprenez à déployer et à mettre à l'échelle vos applications.",
			"de": "Erstellen Sie vollständige Webanwendungen vom Frontend bis zum Backend mit React für den Client und Node.js für den Server. Lernen Sie, Ihre Anwendungen bereitzustellen und zu skalieren.",
			"it": "Costruisci applicazioni web complete dal frontend al backend usando React per il client e Node.js per il server. Impara a distribuire e scalare le tue applicazioni.",
			"pt": "Construa aplicações web completas do frontend ao backend usando React para o cliente e Node.js para o servidor. Aprenda a implantar e dimensionar suas aplicações.",
			"ru": "Создавайте полноценные веб-приложения от фронтенда до бэкенда, используя React для клиента и Node.js для сервера. Научитесь развертывать и масштабировать свои приложения.",
			"zh": "使用React作为客户端和Node.js作为服务器，构建从前端到后端的完整Web应用程序。学习部署和扩展您的应用程序。",
			"ja": "Reactをクライアント、Node.jsをサーバーとして使用して、フロントエンドからバックエンドまで完全なWebアプリケーションを構築します。アプリケーションのデプロイとスケーリングを学びます。",
			"ko": "React를 클라이언트로, Node.js를 서버로 사용하여 프론트엔드에서 백엔드까지 완전한 웹 애플리케이션을 구축합니다. 애플리케이션 배포 및 확장 방법을 배웁니다."
		},
		"presentedBy": "Michael Chen",
		"instructorImage": "https://example.com/images/michael-chen.jpg",
		"isModular": true,
		"isDraft": false,
		"introVideo": {
			"en": "https://example.com/videos/fullstack-intro-en.mp4",
			"es": "https://example.com/videos/fullstack-intro-es.mp4",
			"fr": "https://example.com/videos/fullstack-intro-fr.mp4",
			"de": "https://example.com/videos/fullstack-intro-de.mp4",
			"it": "https://example.com/videos/fullstack-intro-it.mp4",
			"pt": "https://example.com/videos/fullstack-intro-pt.mp4",
			"ru": "https://example.com/videos/fullstack-intro-ru.mp4",
			"zh": "https://example.com/videos/fullstack-intro-zh.mp4",
			"ja": "https://example.com/videos/fullstack-intro-ja.mp4",
			"ko": "https://example.com/videos/fullstack-intro-ko.mp4"
		},
		"introVideoTranscribe": {
			"en": "Welcome to Full Stack Development. In this comprehensive course, you'll learn to build modern web applications...",
			"es": "Bienvenido a Desarrollo Full Stack. En este curso completo, aprenderás a construir aplicaciones web modernas...",
			"fr": "Bienvenue dans Développement Full Stack. Dans ce cours complet, vous apprendrez à construire des applications web modernes...",
			"de": "Willkommen zur Full-Stack-Entwicklung. In diesem umfassenden Kurs lernen Sie, moderne Webanwendungen zu erstellen...",
			"it": "Benvenuto in Sviluppo Full Stack. In questo corso completo imparerai a costruire applicazioni web moderne...",
			"pt": "Bem-vindo ao Desenvolvimento Full Stack. Neste curso abrangente, você aprenderá a construir aplicações web modernas...",
			"ru": "Добро пожаловать в Full Stack разработку. В этом комплексном курсе вы научитесь создавать современные веб-приложения...",
			"zh": "欢迎来到全栈开发。在这个综合课程中，您将学习构建现代Web应用程序...",
			"ja": "フルスタック開発へようこそ。この包括的なコースでは、モダンなWebアプリケーションの構築を学びます...",
			"ko": "풀스택 개발에 오신 것을 환영합니다. 이 포괄적인 과정에서 현대적인 웹 애플리케이션을 구축하는 방법을 배웁니다..."
		},
		"modules": [],
		"sessions": [],
		"availableLanguages": [
			"en",
			"es",
			"fr",
			"de",
			"it",
			"pt",
			"ru",
			"zh",
			"ja",
			"ko"
		]
	}
]
